# ResetCellOverride Method (Int32, Int32)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..ResetCellOverride Method (Int32, Int32)
TableSectionData Class See Also
---
Resets the override of the cell.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void ResetCellOverride(
	int nRow,
	int nCol
)
```

Visual Basic
---
```text
Public Sub ResetCellOverride ( _
	nRow As Integer, _
	nCol As Integer _
)
```

Visual C++
---
```text
public:
void ResetCellOverride(
	int nRow,
	int nCol
)
```

# ### Parameters
nRow
    Type: System..::..Int32
nCol
    Type: System..::..Int32
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given row number nRow is invalid. -or- The given column number nCol is invalid. -or- Only allow to override cell style for header section or column header in body section. |

# See Also
TableSectionData Class
ResetCellOverride Overload
Autodesk.Revit.DB Namespace